Revit 2026 API

# RebarSpliceOptions Properties

---

The RebarSpliceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SplicePosition | Identifies the splice line position. |
|  | SpliceTypeId | Identifies the id of the Rebar Splice Type. |

#### Reference

RebarSpliceOptions Class

Autodesk.Revit.DB.Structure Namespace